/*紫微斗數 Chinese Astrology Zi Wei Dou Shu*/
/*天干地支五行局*/
var YinYang = ["Yang", "Yin"];
var HeavenlyStems = [
  "甲",
  "乙",
  "丙",
  "丁",
  "戊",
  "己",
  "庚",
  "辛",
  "壬",
  "癸",
];
var ShengXiaoGB = [
  "Rat",
  "Ox",
  "Tiger",
  "Rabbit",
  "Dragon",
  "Snake",
  "Horse",
  "Goat",
  "Monkey",
  "Rooster",
  "Dog",
  "Pig"
];

var EarthlyBranches = [
  "子",
  "丑",
  "寅",
  "卯",
  "辰",
  "巳",
  "午",
  "未",
  "申",
  "酉",
  "戌",
  "亥",
];
var Palace = [
  "【Life Palace】",       // 【命宮】
  "【Parents Palace】",    // 【父母宮】
  "【Happy Palace】",      // 【福德宮】 (Fortune Palace)
  "【Property Palace】",   // 【田宅宮】
  "【Career Palace】",     // 【官祿宮】
  "【Friends Palace】",    // 【交友宮】
  "【Travel Palace】",     // 【遷移宮】
  "【Health Palace】",     // 【疾厄宮】
  "【Wealth Palace】",     // 【財帛宮】
  "【Child Palace】",      // 【子女宮】
  "【Marriage Palace】",   // 【夫妻宮】
  "【Siblings Palace】",   // 【兄弟宮】
  "【Body】"              // 【身】
];


var FiveElements = ["Shui Er Ju", "Huo Liu Ju", "Tu Wu Ju", "Mu San Ju", "Jin Si Ju"];
var DaShian = [2, 6, 5, 3, 4]; //搭配五行局
/*Stars*/
var StarM_A14 = [
  "Zi Wei<br>",
  "Tian Ji<br>",
  "Tai Yang<br>",
  "Wu Qu<br>",
  "Tian Tong<br>",
  "Lian Zhen<br>",
  "Tian Fu<br>",
  "Tai Yin<br>",
  "Tan Lang<br>",
  "Ju Men<br>",
  "Tian Xiang<br>",
  "Tian Liang<br>",
  "Qi Sha<br>",
  "Po Jun<br>"
];

var StarM_A07 = [
  "Wen Chang<br>",
  "Wen Qu<br>",
  "Zuo Fu<br>",
  "You Bi<br>",
  "Tian Kui<br>",
  "Tian Yue<br>",
  "Lu Cun<br>"
];

var StarM_S04 = [
  "Hua Lu<br>",
  "Hua Quan<br>",
  "Hua Ke<br>",
  "Hua Ji<br>"
];

var StarM_B06 = [
  "Qing Yang<br>",
  "Tuo Luo<br>",
  "Huo Xing<br>",
  "Ling Xing<br>",
  "Tian Kong<br>",
  "Di Jie<br>"
];

var StarO_S05 = [
  "Tian Ma<br>",
  "Long Chi<br>",
  "Feng Ge<br>",
  "Hong Luan<br>",
  "Tian Xi<br>"
];

/*0:水二局:[1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10,11,11,0,0,1,1,2,2,3,3,4]
  3:木三局:[4,1,2,5,2,3,6,3,4,7,4,5,8,5,6,9,6,7,10,7,8,11,8,9,0,9,10,1,10,11]
  4:金四局:[11,4,1,2,0,5,2,3,1,6,3,4,2,7,4,5,3,8,5,6,4,9,6,7,5,10,7,8,6,11]
  2:土五局:[6,11,4,1,2,7,0,5,2,3,8,1,6,3,4,9,2,7,4,5,10,3,8,5,6,11,4,9,6,7]
  1:火六局:[9,6,11,4,1,2,10,7,0,5,2,3,11,8,1,6,3,4,0,9,2,7,4,5,1,10,3,8,5,6]*/
var FiveEleTable = [
  [
    1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 0, 0, 1,
    1, 2, 2, 3, 3, 4,
  ],
  [
    9, 6, 11, 4, 1, 2, 10, 7, 0, 5, 2, 3, 11, 8, 1, 6, 3, 4, 0, 9, 2, 7, 4, 5,
    1, 10, 3, 8, 5, 6,
  ],
  [
    6, 11, 4, 1, 2, 7, 0, 5, 2, 3, 8, 1, 6, 3, 4, 9, 2, 7, 4, 5, 10, 3, 8, 5, 6,
    11, 4, 9, 6, 7,
  ],
  [
    4, 1, 2, 5, 2, 3, 6, 3, 4, 7, 4, 5, 8, 5, 6, 9, 6, 7, 10, 7, 8, 11, 8, 9, 0,
    9, 10, 1, 10, 11,
  ],
  [
    11, 4, 1, 2, 0, 5, 2, 3, 1, 6, 3, 4, 2, 7, 4, 5, 3, 8, 5, 6, 4, 9, 6, 7, 5,
    10, 7, 8, 6, 11,
  ],
];
var FiveEleArr = [
  [0, 1, 3, 2, 4, 1],
  [1, 2, 4, 3, 0, 2],
  [2, 3, 0, 4, 1, 3],
  [3, 4, 1, 0, 2, 4],
  [4, 0, 2, 1, 3, 0],
];

//StarM_A14 => 0:紫微,1:天機,2:太陽,3:武曲,4:天同,5:廉貞,6:天府,7:太陰,8:貪狼,9:巨門,10:天相,11:天梁,12:七殺,13:破軍
var Star_A14 = [
  [[0], [], [13], [], [5, 6], [7], [8], [4, 9], [3, 10], [2, 11], [12], [1]],
  [[1], [0, 13], [], [6], [7], [5, 8], [9], [10], [4, 11], [3, 12], [2], []],
  [[13], [1], [0, 6], [7], [8], [9], [5, 10], [11], [12], [10], [3], [2]],
  [[2], [6], [1, 7], [0, 8], [9], [10], [11], [5, 12], [], [], [4], [3, 13]],
  [[3, 6], [2, 7], [8], [1, 9], [0, 10], [11], [12], [], [5], [], [13], [4]],
  [
    [4, 7],
    [3, 8],
    [2, 9],
    [10],
    [1, 10],
    [0, 12],
    [],
    [],
    [],
    [5, 13],
    [],
    [6],
  ],
  [[8], [4, 9], [3, 10], [2, 11], [12], [1], [0], [], [13], [], [5, 6], [7]],
  [[9], [10], [4, 11], [3, 12], [2], [], [1], [0, 13], [], [6], [7], [5, 8]],
  [[5, 10], [11], [12], [10], [3], [2], [13], [1], [0, 6], [7], [8], [9]],
  [[11], [5, 12], [], [], [4], [3, 13], [2], [6], [1, 7], [0, 8], [9], [10]],
  [[12], [], [5], [], [13], [4], [3, 6], [2, 7], [8], [1, 9], [0, 10], [11]],
  [
    [],
    [],
    [],
    [5, 13],
    [],
    [6],
    [4, 7],
    [3, 8],
    [2, 9],
    [10],
    [1, 10],
    [0, 12],
  ],
];
//安紫微諸星表，第7列，[6]為天府
var Star_Z06 = [
  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
  [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
  [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8],
  [8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7],
  [7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5, 6],
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3],
  [4, 3, 2, 1, 0, 11, 10, 9, 8, 7, 6, 5],
];
var Star_T08 = [
  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0],
  [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1],
  [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2],
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3],
  [5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4],
  [6, 7, 8, 9, 10, 11, 0, 1, 2, 3, 4, 5],
  [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
];
//StarM_A07=new Array("文昌","文曲","左輔","右弼","天魁","天鉞","祿存");
//0:文昌 1:文曲 (時) 2:左輔 3:右弼 (月) 4:天魁 5:天鉞 6:祿存(年干)
var Star_G07 = [
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11],
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3],
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3],
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11],
  [1, 0, 11, 11, 1, 0, 1, 6, 3, 3],
  [7, 8, 9, 9, 7, 8, 7, 2, 5, 5],
  [2, 3, 5, 6, 5, 6, 8, 9, 11, 0],
];
//StarM_S04=new Array("化祿","化權","化科","化忌");
//0:紫微,1:天機,2:太陽,3:武曲,4:天同,5:廉貞,6:天府,7:太陰,8:貪狼,9:巨門,10:天相,11:天梁,12:七殺,13:破軍
//0:文昌 1:文曲 (時) 2:左輔 3:右弼 (月) 4:天魁 5:天鉞 6:祿存(年干)
//0:化祿 1:化權 2:化科 3:化忌
var Star_S04 = [
  [
    StarM_A14[5],
    StarM_A14[1],
    StarM_A14[4],
    StarM_A14[7],
    StarM_A14[8],
    StarM_A14[3],
    StarM_A14[2],
    StarM_A14[9],
    StarM_A14[11],
    StarM_A14[13],
  ],
  [
    StarM_A14[13],
    StarM_A14[11],
    StarM_A14[1],
    StarM_A14[4],
    StarM_A14[7],
    StarM_A14[8],
    StarM_A14[3],
    StarM_A14[2],
    StarM_A14[0],
    StarM_A14[9],
  ],
  [
    StarM_A14[3],
    StarM_A14[0],
    StarM_A07[0],
    StarM_A14[1],
    StarM_A07[3],
    StarM_A14[11],
    StarM_A14[7],
    StarM_A07[1],
    StarM_A07[2],
    StarM_A14[7],
  ],
  [
    StarM_A14[2],
    StarM_A14[7],
    StarM_A14[5],
    StarM_A14[9],
    StarM_A14[1],
    StarM_A07[1],
    StarM_A14[4],
    StarM_A07[0],
    StarM_A14[3],
    StarM_A14[8],
  ],
];
//StarM_B06=new Array("擎羊","陀羅","火星","鈴星","天空","地劫");
//0:擎羊 1:陀羅 2:火星 3:鈴星 4:天空 5:地劫
//0:2,6,10 1:8,0,4 2:5,9,1 3:11,3,7  %4=> 2,0,1,3
//改成0:8,0,4 1:5,9,1 2:2,6,10 3:11,3,7
var Star_B06 = [
  [3, 4, 6, 7, 6, 7, 9, 10, 0, 1],
  [1, 2, 4, 5, 4, 5, 7, 8, 10, 11],
  [
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1],
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 0],
    [9, 10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8],
  ],
  [
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2],
    [10, 11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
  ],
  [11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0],
  [11, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
];
//StarO_S05=new Array("天馬","龍池","鳳閣","紅鸞","天喜"");
var Star_OS5 = [
  [2, 11, 8, 5, 2, 11, 8, 5, 2, 11, 8, 5],
  [4, 5, 6, 7, 8, 9, 10, 11, 0, 1, 2, 3],
  [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11],
  [3, 2, 1, 0, 11, 10, 9, 8, 7, 6, 5, 4],
  [9, 8, 7, 6, 5, 4, 3, 2, 1, 0, 11, 10],
];


var year_to_stem_branch = {
  1900: "Geng Zi",
  1901: "Xin Chou",
  1902: "Ren Yin",
  1903: "Gui Mao",
  1904: "Jia Chen",
  1905: "Yi Si",
  1906: "Bing Wu",
  1907: "Ding Wei",
  1908: "Wu Shen",
  1909: "Ji You",
  1910: "Geng Xu",
  1911: "Xin Hai",
  1912: "Ren Zi",
  1913: "Gui Chou",
  1914: "Jia Yin",
  1915: "Yi Mao",
  1916: "Bing Chen",
  1917: "Ding Si",
  1918: "Wu Wu",
  1919: "Ji Wei",
  1920: "Geng Shen",
  1921: "Xin You",
  1922: "Ren Xu",
  1923: "Gui Hai",
  1924: "Jia Zi",
  1925: "Yi Chou",
  1926: "Bing Yin",
  1927: "Ding Mao",
  1928: "Wu Chen",
  1929: "Ji Si",
  1930: "Geng Wu",
  1931: "Xin Wei",
  1932: "Ren Shen",
  1933: "Gui You",
  1934: "Jia Xu",
  1935: "Yi Hai",
  1936: "Bing Zi",
  1937: "Ding Chou",
  1938: "Wu Yin",
  1939: "Ji Mao",
  1940: "Geng Chen",
  1941: "Xin Si",
  1942: "Ren Wu",
  1943: "Gui Wei",
  1944: "Jia Shen",
  1945: "Yi You",
  1946: "Bing Xu",
  1947: "Ding Hai",
  1948: "Wu Zi",
  1949: "Ji Chou",
  1950: "Geng Yin",
  1951: "Xin Mao",
  1952: "Ren Chen",
  1953: "Gui Si",
  1954: "Jia Wu",
  1955: "Yi Wei",
  1956: "Bing Shen",
  1957: "Ding You",
  1958: "Wu Xu",
  1959: "Ji Hai",
  1960: "Geng Zi",
  1961: "Xin Chou",
  1962: "Ren Yin",
  1963: "Gui Mao",
  1964: "Jia Chen",
  1965: "Yi Si",
  1966: "Bing Wu",
  1967: "Ding Wei",
  1968: "Wu Shen",
  1969: "Ji You",
  1970: "Geng Xu",
  1971: "Xin Hai",
  1972: "Ren Zi",
  1973: "Gui Chou",
  1974: "Jia Yin",
  1975: "Yi Mao",
  1976: "Bing Chen",
  1977: "Ding Si",
  1978: "Wu Wu",
  1979: "Ji Wei",
  1980: "Geng Shen",
  1981: "Xin You",
  1982: "Ren Xu",
  1983: "Gui Hai",
  1984: "Jia Zi",
  1985: "Yi Chou",
  1986: "Bing Yin",
  1987: "Ding Mao",
  1988: "Wu Chen",
  1989: "Ji Si",
  1990: "Geng Wu",
  1991: "Xin Wei",
  1992: "Ren Shen",
  1993: "Gui You",
  1994: "Jia Xu",
  1995: "Yi Hai",
  1996: "Bing Zi",
  1997: "Ding Chou",
  1998: "Wu Yin",
  1999: "Ji Mao",
  2000: "Geng Chen",
  2001: "Xin Si",
  2002: "Ren Wu",
  2003: "Gui Wei",
  2004: "Jia Shen",
  2005: "Yi You",
  2006: "Bing Xu",
  2007: "Ding Hai",
  2008: "Wu Zi",
  2009: "Ji Chou",
  2010: "Geng Yin",
  2011: "Xin Mao",
  2012: "Ren Chen",
  2013: "Gui Si",
  2014: "Jia Wu",
  2015: "Yi Wei",
  2016: "Bing Shen",
  2017: "Ding You",
  2018: "Wu Xu",
  2019: "Ji Hai",
  2020: "Geng Zi",
  2021: "Xin Chou",
  2022: "Ren Yin",
  2023: "Gui Mao",
  2024: "Jia Chen",
  2025: "Yi Si",
};